name: "ensemble_guardrail"
platform: "ensemble"
max_batch_size: 8

input [
  {
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "STATUS_CODE"
    data_type: TYPE_INT32
    dims: [ 1 ]
  },
  {
    name: "RESULT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "guardrail"
      model_version: -1
      input_map {
        key: "TEXT"
        value: "TEXT"
      }
      output_map {
        key: "VALIDATION_RESULT"
        value: "guardrail_result"
      }
    }
  ]
}

version_policy: { all { }}